[
{  
  "ID": "TEDXA-01",
  "nome": "Positive and Negative Affect Schedule (PANAS)",
  "resumo": "Uma escala de 5 pontos que avalia as afetividades positivas e negativas. É capaz de capturar tanto a característica quanto o estado afetivo.",
  "metodo": "Questionário",
  "referencia": "Watson, D., Clark, L. A., & Tellegen, A. (1988). Development and validation of brief measures of positive and negative affect: The PANAS scales. Journal of Personality and Social Psychology, 54, 1063 1070",
  "contexto": "O experimento foi aplicado em 32 projetos estudantis com 155 participantes, durante 2 anos consecutivos. Os estudantes estavam envolvidos no curso do projeto de software, Software Project Course (SWP), da Leibniz Universität Hannover. As reuniões foram executadas pelos estudantes que responderam em cada uma delas um questionário Positive and Negative Affect",
  "ambiente": "Academia",
  "utilizacao": "Reuniões de elicitação de requisitos de projetos de software",
  "motivo": "A PANAS é amplamente utilizada para identificar efeitos positivos e negativos na psicologia.",
  "como_utilizar" : ["Explique o questionário para a pessoa que irá preencher. Certifique-se de que ela entenda as subescalas de emoções positivas e negativas, bem como as escalas de avaliação",
					 "Peça que a pessoa avalie em que medida ela experimentou cada emoção listada no questionário, durante um período específico de tempo, como nas últimas horas, no último dia ou na última semana",
           "Calcule as pontuações separadamente para as subescalas de emoções positivas e negativas"
					 ],
  "tempo" : "4",
  "participantes" : "155",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/panas.png?raw=true",
  "artigo" : "https://www.sciencedirect.com/science/article/pii/S016412121830089X",
  "template" : "https://doi.apa.org/doiLanding?doi=10.1037/0022-3514.54.6.1063",
  "tags" : ["tag04",
           "tag05",
           "tag12",
           "tag13",
           "tag15",
           "tag18",
           "tag22",
           "tag24"
          ]
},
{  
  "ID": "TEDXA-02",
  "nome": "The Advanced Interaction Analysis for Teams (act4teams) Coding Scheme",
  "resumo": "é uma ferramenta validada para medir a resolução de problemas que ocorrem em grupos e equipes durante reuniões",
  "metodo": "Questionário",
  "referencia": "Kauffeld, S., Lehmann-Willenbrock, N., 2012. Meetings matter: effects of team meetings on team and organizational success. Small Group Res. 43 (2), 130 158",
  "contexto": "O experimento foi aplicado em 32 projetos estudantis com 155 participantes, durante 2 anos consecutivos. Os estudantes estavam envolvidos no curso do projeto de software, Software Project Course (SWP), da Leibniz Universität Hannover. As reuniões foram executadas pelos estudantes que responderam em cada uma delas um questionário Positive and Negative Affect",
  "ambiente": "Academia",
  "utilizacao": "As reuniões de elicitação de requisitos de projetos de software",
  "motivo": "O act4teams é utilizado pra catalogar e classificar reuniões em relação ao humor e afetividades",
  "como_utilizar" : ["As interações de times são gravadas e classificadas em quatro tipos: focadas no problema, procedimental, socio-emocional e orientada para ação",					 
					           "Os vídeos ou gravações são analisados e classificados por codificadores treinados na utilização do act4teams codes"
					 ],
  "tempo" : "4",
  "participantes" : "155",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/act4teams.png?raw=true",
  "artigo": "https://www.sciencedirect.com/science/article/pii/S016412121830089X",
  "template" : "https://journals.sagepub.com/doi/pdf/10.1177/1046496411429599",
  "tags" : ["tag04",
           "tag05",
           "tag12",
           "tag13",
           "tag15",
           "tag18",
           "tag22",
           "tag24"
          ]
},
{  
  "ID": "TEDXA-03",
  "nome": "Formulario de autoavaliação baseado na Epistemically-Related Emotion Scales (EES)",
  "resumo": "é uma ferramenta que medem surpresa, curiosidade, prazer, confusão, ansiedade, frustração e tédio que ocorrem durante atividades cognitivas epistêmicas",
  "metodo": "Questionário",
  "referencia": "R. Pekrun, E. Vogl, K. R. Muis, and G. M. Sinatra, “Measuring emotions during epistemic activities: the Epistemically-Related Emotion Scales,” Cognition and Emotion, vol. 31, no. 6, pp. 1268–1276, 2017",
  "contexto": "Foi aplicado em 310 estudantes de informática um instrumento de autoavaliação composto por 13 itens relativos à emoções: tédio, ansiedade, confusão, curiosidade, raiva, excitação, esperança, frustração, interesse, orgulho, surpresa, vergonha, alívio. Cada item foi medido em uma escala Likert de 5 pontos após atividaders de aprendizado de programação como exercícios de laboratírio, provas, exercícios em sala e projetos de programação etc.",
  "ambiente": "Academia",
  "utilizacao": "As atividades de aprendizado em programação de computadores",
  "motivo": "O instrumento é fácil de administrar, minimamente invasivo e não causa perturbações no fluxo de trabalho dos estudantes, identificando de forma rápida e fácil as emoções para cada uma das atividades selecionadas.",
  "como_utilizar" : ["Definição das fases de apendizado de programação: Práticas em sala de aula, exercícios no laboratório, projetos de programação e avaliações etc",
					 "Aplicação do instrumento de autoavaliação ao final de cada uma das fases"
					 ],
  "tempo" : "6",
  "participantes" : "310",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/ees.png?raw=true",
  "artigo": "https://dl.acm.org/doi/abs/10.1145/3335595.3335608?casa_token=y3eWQyoMieQAAAAA:ZpdhufmXs3g_Ewu-s5tjs--Nsz0jUao6zbC-tiFmHZr_ersYcwnkOnLcGy8lJVPb_0Njr9_KIQbuYGk",
  "template" : "https://www.tandfonline.com/doi/abs/10.1080/02699931.2016.1204989",
  "tags" : ["tag02",
           "tag10",
           "tag13",
           "tag15",
           "tag18",
           "tag22",
           "tag24"
          ]
},
{  
  "ID": "TEDXA-04",
  "nome": "Scale of Positive and Negative Experience - SPANE",
  "resumo": "Uma escala que avalia a felicidade dos participantes, pedindo-lhes que informem a frequência de suas experiências positivas e negativas durante as últimas quatro semanas. SPANE tem sido relatada como capaz de medir as experiências que afetam a felicidade, independentemente das origens, nível de ativação mental ou contexto cultural, e capta o efeito do todo o espectro afetivo.",
  "metodo": "Questionário",
  "referencia": "Diener, E., Wirtz, D., Tov, W., Kim-Prieto, C., Choi. D., Oishi, S., & Biswas-Diener, R. (2009). New measures of well-being: Flourishing and positive and negative feelings. Social Indicators Research, 39, 247-266.",
  "contexto": "Foi aplicado em usuários do Github uma survey contendo 3 questionários:  demográfico, SPANE com 12 itens relacionados à felicidade e um terceiro com questões sobre a experiência e as causas e consequencias, positivas ou negativas, enquanto se estava desenvolvendo software",
  "ambiente": "Indústria, Academia",
  "utilizacao": "A (in)felicidade enquanto se esta desenvolvendo software",
  "motivo": "SPANE é um instrumento usado na pscologia para identificar de forma fácil e rápida alguns aspectos comuns ao conceito hedônico de felicidade",
  "como_utilizar" : ["Explique a escala para a pessoa que irá preencher. Certifique-se de que ela entenda as subescalas de emoções positivas e negativas, bem como as escalas de avaliação",
                     "Solicite que a pessoa avalie o quanto ela experimentou cada emoção positiva e negativa durante o período de tempo especificado na escala",
					           "Calcule as pontuações separadamente para as subescalas de emoções positivas e negativas",
                     "Calcule a pontuação total subtraindo a pontuação da subescala de emoções negativas da subescala de emoções positivas"
					 ],
  "tempo" : "12",
  "participantes" : "1908",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/spane.png?raw=true",
  "artigo" : "https://ieeexplore.ieee.org/abstract/document/7961892/",
  "template" : "https://link.springer.com/article/10.1007/s11205-009-9493-y",
  "tags" : ["tag01",
           "tag14",
           "tag15",
           "tag19",
           "tag20",
           "tag21"
          ]
},
{  
  "ID": "TEDXA-05",
  "nome": "API AlchemyLanguage Emotion Analysis",
  "resumo": "API para análise de sentimentos usada para detectar cinco emoções distintas no texto - alegria, medo, tristeza, raiva e nojo.",
  "metodo": "Mineração de dados",
  "referencia": "IBM. Watson Explorer. Ibm Watson Explorer. EUA: IBM, 2016. Disponível em: https://www.ibm.com/docs/pt/watson-explorer/12.0.x. Acesso em: 1 mar. 2023.",
  "contexto": "Foi utilizada metodologia Mining Software Repositories (MSR) no site de perguntas e respostas Stack Overflow, utilzando mais de 1,5 milhão de perguntas e respostas em HTML sobre Ecosystema de desenvolvimento MOBILE (Android, IOS e Windows Phone), enviadas por XML para a API AlchemyLanguage3 Emotion Analysis, visando detectar raiva, repugnância, medo, alegria e tristeza.",
  "ambiente": "Indústria, Academia",
  "utilizacao": "O ecosistema de desenvolvimento MOBILE",
  "motivo": "A API AlchemyLanguage3 Emotion Analysis é bastante utilizada para identificar emoções em bases textuais",
  "como_utilizar" : ["Construa a estrutura do seu código em sua linguagem de programação de escolha e utilize a biblioteca AlchemyAPI para enviar o texto que deseja analisar",
					           "Aplicação dos na API AlchemyLanguage3 Emotion Analysis",
					           "Classificar de forma ordenada os resultados da API"
					 ],
  "tempo" : "12",
  "participantes" : "1500000",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/ibmapi.png?raw=true",
  "artigo" : "https://dl.acm.org/doi/abs/10.1145/3098322.3098325?casa_token=kZBLvb7SHw4AAAAA:SHJiMci5Q3_PTDxAJDGEnPvDbq3JGqkwknYilNaRqrrzFI-6jZM6l8X6R9_iV1MWDeNN1R0C9-TKB-g",
  "template" : "https://www.ibm.com/docs/pt/watson-explorer/12.0.x",
  "tags" : ["tag08",
           "tag11",
           "tag14",
           "tag17",
           "tag19",
           "tag20",
           "tag21"
          ]
},
{  
  "ID": "TEDXA-06",
  "nome": "Questionário Circumflexo de Russel sobre emoções positivas e negativas",
  "resumo": "O questionário Circumflexo de Russel é uma ferramenta psicológica que ajuda a avaliar as emoções positivas e negativas experimentadas por uma pessoa",
  "metodo": "Questionário, Entrevistas",
  "referencia": "J. Russell, “A circumplex model of affect,” Journal of personality and social psychology, vol. 39, no. 6, pp. 1161 1178, 1980, J. Riseberg, J. Klein, R. Fernandez, and R. W. Picard, “Frustrating the user on purpose: Using biosignals in a pilot study to detect the users emotional state,” in Conference Summary on Human Factors in Computing Systems. ACM, 1998, pp. 227 228. [Online]. Available: http://doi.acm.org/10.1145/286498.286715",
  "contexto": "Participaram do experimento 6 desenvolvedores profissionais de software e 11 alunos de doutorado com especialização em informática. Os desenvolvedores profissionais foram recrutados a partir de duas empresas de desenvolvimento de software na Suíça. Os estudantes foram recrutados na Universidade de Zurique. Os participantes foram instruídos a usar os sensores EEG e respondiam questionarios durante a após as suas tarefas",
  "ambiente": "Indústria, Academia",
  "utilizacao": "A mudança de tarefas de desenvolvimento de software",
  "motivo": "O questionário Circumflexo de Russel é ajuda a avaliar as emoções positivas e negativas durante atividades",
  "como_utilizar" : ["Ler as instruções cuidadosamente para entender o objetivo do questionário e como preencher os itens",
					           "Ler cada item cuidadosamente e escolher a resposta que melhor descreve a intensidade da emoção que você está experimentando",
					           "Certifique-se de que está avaliando a emoção específica descrita em cada item, e não uma emoção relacionada",
					           "Tente fazer o participante ser o mais honesto e preciso possível em suas respostas",
                     "Após completar todos os itens, somar as pontuações de cada categoria para obter uma pontuação total para emoções positivas e outra para emoções negativas"
					 ],
  "tempo" : "1",
  "participantes" : "17",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/sensor.png?raw=true",
  "artigo" : "https://ieeexplore.ieee.org/abstract/document/7194617/",
  "template" : "https://psycnet.apa.org/journals/psp/39/6/1161/",
  "tags" : ["tag01",
           "tag03",
           "tag06",
           "tag07",
           "tag15",
           "tag16",
           "tag18",
           "tag19",
           "tag22"
          ]
},
{  
  "ID": "TEDXA-07",
  "nome": "the self-assessment manikin SAM",
  "resumo": "Avaliação pictórica não-verbal que mede diretamente o prazer, a excitação e o domínio associados à afetividade de uma pessoa durante a reação a uma grande variedade de estímulos.",
  "metodo": "Questionário, Entrevistas",
  "referencia": "Bradley MM, Lang PJ. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of Behavior Therapy and Experimental Psychiatry 25(1):49–59 DOI 10.1016/0005-7916(94)90063-9.",
  "contexto": "Foram aplicadas entrevistas em dois programadores com mais de 5 anos de experiência, trabalhando em dois projetos diferentes mas realizando as mesmas atividades. Os participantes ficaram trabalhando nesta pesquisa de forma integral durante 3 meses, respondendo as entrevistas e questinarios de forma presencial e ",
  "ambiente": "Academia",
  "utilizacao": "as afetividades, efeitos afetivos, durante a programação",
  "motivo": "O questionário SAM é bastante utilizado para identificar dimensões afetivas, incluindo valência, exitação e domínio",
  "como_utilizar" : ["Entenda as três dimensões do SAM: ",
					 "Valência: representa o grau de positividade ou negatividade da emoção sentida em relação ao estímulo avaliado",
           "Excitação: representa o grau de ativação ou excitação sentida em relação ao estímulo avaliado.",
           "Dominância: representa o grau de controle ou domínio que se sente em relação ao estímulo avaliado",
           "Identifique o estímulo que deseja avaliar. Isso pode ser qualquer coisa, como uma imagem, um vídeo, um som ou um objeto",
           "Mostre ao participante as figuras humanas padronizadas do SAM para cada dimensão e explique como as figuras são usadas para avaliar a experiência",
           "Registre as pontuações em cada dimensão para análise posterior"
					 ],
  "tempo" : "3",
  "participantes" : "2",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/sam.png?raw=true",
  "artigo" : "https://peerj.com/articles/cs-18.pdf",
  "template" : "https://www.sciencedirect.com/science/article/pii/0005791694900639",
  "tags" : ["tag01",
           "tag02",
           "tag06",
           "tag07",
           "tag10",
           "tag13",
           "tag15",
           "tag16",
           "tag19",
           "tag22"
          ]
},
{  
  "ID": "TEDXA-08",
  "nome": "Affective Events Theory(AET)",
  "resumo": "Affective Events Theory (AET) é uma teoria que descreve como eventos afetivos no ambiente de trabalho podem afetar as emoções, atitudes e comportamentos dos participantes",
  "metodo": "Entrevistas e questionários",
  "referencia": "Graziotin, Daniel, Xiaofeng Wang, and Pekka Abrahamsson. 'How do you feel, developer? An explanatory theory of the impact of affects on programming performance.' PeerJ Computer Science 1 (2015): e18.",
  "contexto": "Foram aplicadas entrevistas em dois programadores com mais de 5 anos de experiência, trabalhando em dois projetos diferentes mas realizando as mesmas atividades. Os participantes ficaram trabalhando nesta pesquisa de forma integral durante 3 meses, respondendo as entrevistas e questinarios de forma presencial",
  "ambiente": "Academia",
  "utilizacao": "as afetividades, efeitos afetivos, durante a programação",
  "motivo": "A Affective Events Theory pode ser aplicada em vários contextos, incluindo organizações, equipes de trabalho e ambientes educacionais",
  "como_utilizar" : ["Identifique os eventos afetivos relevantes",
					           "Avalie a intensidade e a duração dos eventos afetivos",
                     "Analise as respostas emocionais e comportamentais dos participantes",
                     "Implemente estratégias para lidar com os eventos afetivos"
					 ],
  "tempo" : "3",
  "participantes" : "2",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/aet.png?raw=true",
  "artigo" : "https://peerj.com/articles/cs-18.pdf",
  "template" : "https://www.sciencedirect.com/science/article/pii/0005791694900639",
  "tags" : ["tag01",
           "tag02",
           "tag06",
           "tag07",
           "tag10",
           "tag13",
           "tag15",
           "tag16",
           "tag19",
           "tag22"
          ]
},
{  
  "ID": "TEDXA-09",
  "nome": "Intrinsic Motivation Inventory - IMI (versão reduzida para DX)",
  "resumo": "O Inventário de Motivação Intrínseca (IMI) é um artefato para medição multidimensional destinado a avaliar a experiência subjetiva dos participantes relacionada a uma atividade alvo em experimentos de laboratório. Uma vez que o IMI original é longo e repetitivo, pode ser utilizada  uma versão resumida com itens selecionados de acordo com os fatores de DX e as seguintes assinaturas do IMI: interesse/ alegria, percepção de competência, esforço/importância, e percepção de escolha.",
  "metodo": "Questionário",
  "referencia": "",
  "contexto": "Com apoio da Qt Company foi realizada uma survey com os utilizadores do Qt Creator com 57 participantes em 25 países.",
  "ambiente": "Indústria",
  "utilizacao": "Avaliar a utilização de uma ferramenta",
  "motivo": "IMI pode ser utilizada para medir profundidade, foco, concentração e agradabilidade",
  "como_utilizar" : ["Explique o questionário para a pessoa que irá preencher",
                     "Peça que a pessoa avalie em que medida ela se sentiu motivada por diferentes fatores durante a atividade em questão",
                     "Calcule as pontuações separadamente para cada subescala"
  ],
  "tempo" : "6",
  "participantes" : "25",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/imi.png?raw=true",
  "artigo" : "https://library.oapen.org/bitstream/handle/20.500.12657/28138/1/1001856.pdf#page=117",
  "template" : "https://library.oapen.org/bitstream/handle/20.500.12657/28138/1/1001856.pdf#page=117",
  "tags" : ["tag02",
           "tag14",
           "tag15",
           "tag16",
           "tag19",
           "tag20",
           "tag21"
          ]
},
{  
  "ID": "TEDXA-10",
  "nome": "Questionário de avaliação de DX em Deep Learning (DL)",
  "resumo": "O questionário foi planejado para uso junto aos profissionais que desenvolvem aplicações de DL. Foi produzido utilizando um plano Delphi com experts (profissionais, mestres e doutores) que avaliaram as questões e definiram um índice de validação de conteúdo (Content Validity Ratio - CVR) a ser aplicado. Esse índice servirá como base para avaliação de DX conforme o Framework de FangerHorn",
  "metodo": "Questionário",
  "referencia": "Lee, Heeyoung, and Younghwan Pan. 'Evaluation of the Nomological Validity of Cognitive, Emotional, and Behavioral Factors for the Measurement of Developer Experience.' Applied Sciences 11.17 (2021): 7805",
  "contexto": "Com apoio de doutores e mestres foi desenvolvido um questionário para avaliar o desenvolvimento em DL. O questionario foi aplicado com 260 participantes em duas indústrias da Corea do Sul, de forma online, durante 2 meses",
  "ambiente": "Indústria",
  "utilizacao": "Desenvolvimento de aplicações DL",
  "motivo": "Foi utilizado para avaliar DX em um ambiente com a metodologia Deep Learning (DL)",
  "como_utilizar" : [ "Aplicação de forma online aos particpante",
					            "A avaliação é obtida através da média dos CVR mensurados - 0.799 em cada questão"
					],
  "tempo" : "2",
  "participantes" : "260",
  "imagem" : "https://github.com/fabianlopes/repodx_frontend/blob/main/src/imagens/tecnicas/dl.png?raw=true",
  "artigo" : "https://www.mdpi.com/2076-3417/11/17/7805",
  "template" : "https://www.mdpi.com/2076-3417/11/17/7805",
  "tags" : ["tag01",
           "tag02",
           "tag06",
           "tag07",
           "tag09",
           "tag14",
           "tag15",
           "tag19",
           "tag20",
           "tag21"
          ]
}
]